In [1]:
import pandas as pd

In [2]:
# list형식으로 pandas 생성
data = [10, 20, 30, 40]
#series = pd.Series(data)
series = pd.Series(data, index=['a','b','c','d'])
print(series)

a    10
b    20
c    30
d    40
dtype: int64

In [3]:
# dictionary형식으로 pandas 생성
data = {
    'a' : 10,
    'b' : True,
    'c' : 3.14,
    'd' : 'python'
}

#series = pd.Series(data)
series = pd.Series(data, name = '딕셔너리')
print(series)

a        10
b      True
c      3.14
d    python
Name: 딕셔너리, dtype: object

In [4]:
#series 메서드
print(series.index)
print(series.values)
print(series.shape)

Index(['a', 'b', 'c', 'd'], dtype='object')
[10 True 3.14 'python']
(4,)

In [5]:
# series값 접근
data = ('민지','여',False)
member = pd.Series(data, index =['이름','성별','결혼여부'])
print(member)
print()
print(member['이름'])
print(member[['성별','결혼여부']])

이름         민지
성별          여
결혼여부    False
dtype: object

민지
성별          여
결혼여부    False
dtype: object

In [6]:
data  = [10,20,30,40,50]
series = pd.Series(data,index=['a','b','c','d','e'])

print(series[series>20])
print()
series['c'] = 100
print(series)

c    30
d    40
e    50
dtype: int64

a     10
b     20
c    100
d     40
e     50
dtype: int64

In [7]:
food = ['4 cups','1 cup','2 large','1 can']
series = pd.Series(food,index = ['밀가루','우유','계란','참치캔'],name = 'Dinner')
print(series)

밀가루     4 cups
우유       1 cup
계란     2 large
참치캔      1 can
Name: Dinner, dtype: object

In [8]:
# 데이터 프레임 
data = {
    'Name' : ['홍길동','임꺽정','성춘향'],
    'Age' : [25,30,27],
    'City' : ['서울','부산','인천']
}

df = pd.DataFrame(data)
df

  Name  Age City
0  홍길동   25   서울
1  임꺽정   30   부산
2  성춘향   27   인천

In [9]:
index = ['2020','2021','2022','2023','2024','2025']

yh = pd.Series([140,150,160,170,180,190],index=index)
cs = pd.Series([200,210,220,230,240,250],index=index)

result = pd.DataFrame({
    '영희' : yh,
    '철수' : cs
})

result

       영희   철수
2020  140  200
2021  150  210
2022  160  220
2023  170  230
2024  180  240
2025  190  250

In [10]:
#result.head()
#result.tail()
#result.shape()
#result.info()
#result.columns
#result.values
#result.index
#result.dtypes
print(result[['철수']])

       철수
2020  200
2021  210
2022  220
2023  230
2024  240
2025  250

In [11]:
data = {
    'Name' : ['홍길동','임꺽정','성춘향'],
    'Age' : [25,30,27],
    'City' : ['서울','부산','인천']
}
df = pd.DataFrame(data,index=['a','b','c'])
df

#df.loc['b']
#df.loc['b','Age']
#df.loc['a':'c','Name':'Age']
#df.loc[df['Age']>=30]
#df.loc[:,'Name']
#df.loc['a',:]

#df.iloc[1]
#df.iloc[1,1]
#df.iloc[0:2,0:2]  #끝 값 포함 X
#df.iloc[[0,2],[1,2]]
#df.iloc[0,:]

  Name  Age City
a  홍길동   25   서울
b  임꺽정   30   부산
c  성춘향   27   인천

In [12]:
# 행 추가
new_data = {'Name' : '이몽룡','Age' : 31, 'City' : '포항'}
result = pd.concat([df,pd.DataFrame([new_data])], ignore_index = True)
result

  Name  Age City
0  홍길동   25   서울
1  임꺽정   30   부산
2  성춘향   27   인천
3  이몽룡   31   포항

In [13]:
# 열 추가
result["직업"] = ["엔지니어","개발자","디자이너","기획자"]
result

  Name  Age City    직업
0  홍길동   25   서울  엔지니어
1  임꺽정   30   부산   개발자
2  성춘향   27   인천  디자이너
3  이몽룡   31   포항   기획자

In [14]:
# 요소값 수정
result.at[1,"City"] = "천안"
result.loc[result['Name'] == '임꺽정','Age'] =32
result

  Name  Age City    직업
0  홍길동   25   서울  엔지니어
1  임꺽정   32   천안   개발자
2  성춘향   27   인천  디자이너
3  이몽룡   31   포항   기획자

In [15]:
# column 이름 변경
result.rename(columns={'Name':'이름','Age':'나이','City':'도시'},inplace=True)
result

    이름  나이  도시    직업
0  홍길동  25  서울  엔지니어
1  임꺽정  32  천안   개발자
2  성춘향  27  인천  디자이너
3  이몽룡  31  포항   기획자

In [16]:
# 데이터 정렬
result.sort_values(by='나이',inplace=True, ascending = False)
result

    이름  나이  도시    직업
1  임꺽정  32  천안   개발자
3  이몽룡  31  포항   기획자
2  성춘향  27  인천  디자이너
0  홍길동  25  서울  엔지니어

In [17]:
#컬럼 삭제
#result.drop(columns='도시',inplace=True)
#result

In [18]:
data = { 
    '이름' : ['홍길동','임꺽정','성춘향'],
    '수학' : [85,90,78],
    '영어' : [88,76,92],
    '과학' : [95,89,84]
}

df = pd.DataFrame(data)
df

    이름  수학  영어  과학
0  홍길동  85  88  95
1  임꺽정  90  76  89
2  성춘향  78  92  84

In [19]:
new_data = {'이름':'이몽룡','수학':'88','영어':'85','과학':'90'}
df = pd.concat([df,pd.DataFrame([new_data])],ignore_index=True)
df

    이름  수학  영어  과학
0  홍길동  85  88  95
1  임꺽정  90  76  89
2  성춘향  78  92  84
3  이몽룡  88  85  90

In [20]:
df['Total'] = [268,255,254,263]
df

    이름  수학  영어  과학  Total
0  홍길동  85  88  95    268
1  임꺽정  90  76  89    255
2  성춘향  78  92  84    254
3  이몽룡  88  85  90    263

In [21]:
df.loc[df['이름']=='임꺽정', "영어"] = 80
df

    이름  수학  영어  과학  Total
0  홍길동  85  88  95    268
1  임꺽정  90  80  89    255
2  성춘향  78  92  84    254
3  이몽룡  88  85  90    263

In [22]:
df.rename(columns={'수학':'Math'},inplace=True)

In [23]:
df

    이름 Math  영어  과학  Total
0  홍길동   85  88  95    268
1  임꺽정   90  80  89    255
2  성춘향   78  92  84    254
3  이몽룡   88  85  90    263

In [28]:
#df.loc[~(df['Math']>=80)]
df.loc[~[df['Age'] >= 80]]

KeyError: 'Age'